---
kind: method
id: M:Autodesk.Revit.DB.Element.EvaluateAllParameterValues
zh: 构件、图元、元素
source: html/5250da77-1e16-13c6-fed6-5ef29997e6f9.htm
---
# Autodesk.Revit.DB.Element.EvaluateAllParameterValues Method

**中文**: 构件、图元、元素

Evaluates all the parameters' values of the element.

## Syntax (C#)
```csharp
public IList<EvaluatedParameter> EvaluateAllParameterValues()
```

## Returns
List of EvaluatedParameter of the element.